config/experiments/bash-parser/bash-parser-extensions.org
#+title: Bash Parser - Parser Extensions
#+author: Jeff Farr
#+property: header-args:emacs-lisp :tangle bash-parser-extensions.el
#+auto_tangle: t

* Introduction

This module provides parser extensions for the bash parser, including:

- Indirect operation marking for security-critical nested commands
- Command injection detection for patterns like =bash -c=, =sh -c=, =eval=
- Recursive nested command parsing with quote handling

These extensions enable defense-in-depth security analysis by identifying operations that originate from nested command contexts, which are harder to audit and may require stricter security policies.

* Basic Configuration

#+begin_src emacs-lisp
;;; bash-parser-extensions.el --- Parser extensions -*- lexical-binding: t; -*-
#+end_src

* Dependencies

#+begin_src emacs-lisp
(require 'cl-lib)
#+end_src

* Configuration

** Maximum Recursion Depth

Shared depth limit for recursive parsing across parser modules. This variable
is also defined in bash-parser-recursive.el and both modules use the same limit
to ensure consistent behavior.

#+begin_src emacs-lisp
(defvar jf/bash-recursive-max-depth 10
  "Maximum recursion depth shared across parser modules.
Prevents infinite recursion in pathological nested command cases.
Used by both recursive semantic analysis and nested command parsing.")
#+end_src

* Parser Extensions

This section extends the core parser with additional detection capabilities for security-critical patterns.

** Indirect Operation Marking

Mark file operations that originate from nested commands as indirect. Indirect operations
are harder to audit and may require stricter security policies since they involve command
execution within another command context.

*** Security Implications

Indirect operations have different security characteristics:

- **Audit complexity**: Nested commands are harder to trace in logs
- **Escape risks**: Command injection via nested strings
- **Policy bypass**: Direct validation may miss nested operations
- **Runtime uncertainty**: Indirect operations evaluated at execution time

Defense-in-depth strategy: Some security policies may reject all indirect operations,
while others may apply stricter validation rules (e.g., require explicit approval).

*** Main Marking Function

#+begin_src emacs-lisp
(defun jf/bash-mark-indirect-operations (operations)
  "Mark OPERATIONS as indirect if they should have stricter security policies.

Operations are marked as indirect (:indirect t) if they come from:
- Exec blocks (find -exec, find -execdir)
- Nested shell commands (bash -c, sh -c, zsh -c)
- Command substitution [future]

OPERATIONS is a list of operation plists from extraction functions.

Returns updated operations list with :indirect t added where appropriate.

The :indirect flag is a security signal indicating that the operation
will be executed in a nested context, which may require stricter
validation or explicit approval.

Examples:
  ;; Direct operation - not marked
  (jf/bash-mark-indirect-operations
    '((:file \"file.txt\" :operation :read :source :positional-arg)))
  => ((:file \"file.txt\" :operation :read :source :positional-arg))

  ;; Exec block operation - marked as indirect
  (jf/bash-mark-indirect-operations
    '((:file \"{}\" :operation :delete :source :exec-block)))
  => ((:file \"{}\" :operation :delete :source :exec-block :indirect t))

  ;; Mixed operations - only exec-block marked
  (jf/bash-mark-indirect-operations
    '((:file \"a.txt\" :operation :read :source :positional-arg)
      (:file \"{}\" :operation :delete :source :exec-block)))
  => ((:file \"a.txt\" :operation :read :source :positional-arg)
      (:file \"{}\" :operation :delete :source :exec-block :indirect t))"
  (mapcar
   (lambda (op)
     (let ((source (plist-get op :source)))
       (cond
        ;; Exec blocks are always indirect
        ((eq source :exec-block)
         (plist-put (copy-sequence op) :indirect t))

        ;; Already marked as indirect (from nested command parsing)
        ((plist-get op :indirect)
         op)

        ;; Direct operations remain unmarked
        (t op))))
   operations))
#+end_src

*** Integration with Extraction

The marking function should be applied as a final step in the extraction pipeline,
after all operations have been collected from all sources. This ensures consistent
marking across all extraction paths.

Current integration point: After deduplication in `jf/bash-extract-file-operations`.

The function can be called independently on operation lists, or integrated into
the main extraction flow once nested command parsing is implemented.

Example usage:
#+begin_src emacs-lisp :tangle no
;; Standalone usage
(let* ((parsed (jf/bash-parse "find . -name '*.txt' -exec rm {} \\;"))
       (ops (jf/bash-extract-file-operations parsed)))
  (jf/bash-mark-indirect-operations ops))
;; => Operations from exec block will have :indirect t

;; Integrated usage (future)
(defun jf/bash-extract-file-operations (parsed-command &optional var-context)
  ;; ... extraction logic ...
  (let ((operations (jf/bash--deduplicate-operations all-ops)))
    ;; Mark indirect operations before returning
    (jf/bash-mark-indirect-operations operations)))
#+end_src

** Command Injection Detection

Command injection patterns represent SHELL commands that execute other shell commands as string arguments. These patterns are security-critical because they can bypass static analysis by wrapping malicious commands in strings.

**SCOPE LIMITATION**: This module detects SHELL command injection only (bash, sh, zsh, etc.). Non-shell interpreters like `python -c`, `node -e`, `ruby -e` execute code in their own language and cannot directly execute bash commands. File operations in those languages would require language-specific parsing and are excluded from this implementation.

Shell injection patterns detected:
- =bash -c "command string"= - Execute bash command from string
- =sh -c 'command string'= - Execute sh command from string
- =zsh -c 'command string'= - Execute zsh command from string
- =env -S "prog args"= - Execute program with arguments from string
- =eval "command"= - Evaluate command string (shell built-in)

Non-shell interpreters NOT detected (by design):
- =python -c "code"= - Python code, not bash
- =node -e "code"= - JavaScript code, not bash
- =ruby -e "code"= - Ruby code, not bash

Detection enables recursive parsing and validation of nested shell commands.

*** Command Injection Pattern Database

Define patterns that indicate command execution via string arguments.

#+begin_src emacs-lisp
(defvar jf/bash-command-injection-patterns
  '((bash . (:flags ("-c") :arg-after-flag t))
    (sh . (:flags ("-c") :arg-after-flag t))
    (zsh . (:flags ("-c") :arg-after-flag t))
    (env . (:flags ("-S" "--split-string") :arg-after-flag t))
    (eval . (:no-flag-required t :first-arg t)))
  "Database of command injection patterns.

Each entry maps a command symbol to detection parameters:
  :flags - List of flags that indicate command injection
  :arg-after-flag - If t, nested command is the argument after the flag
  :no-flag-required - If t, command doesn't need a flag (like eval)
  :first-arg - If t, first positional arg is the nested command

Command injection detection is for SHELL commands that execute nested shell code.
Non-shell interpreters (python -c, node -e, ruby -e, etc.) are NOT injection
because they execute code in their own language, not bash. File operations in
those languages require language-specific parsing.

Rationale for exclusion:
1. Python/Node/Ruby code cannot directly execute bash commands
2. File operations in those languages use language-specific APIs
3. Detecting file ops requires parsing Python/JS/Ruby syntax
4. Current implementation maintains cleaner security model

Examples:
  bash -c 'rm file.txt'     - Flag: -c, nested: 'rm file.txt' (shell injection)
  sh -c 'cat file'          - Flag: -c, nested: 'cat file' (shell injection)
  zsh -c 'cat file'         - Flag: -c, nested: 'cat file' (shell injection)
  env -S 'prog arg'         - Flag: -S, nested: 'prog arg' (shell injection)
  eval 'rm file.txt'        - No flag, nested: 'rm file.txt' (shell injection)
  python -c 'print(1)'      - NOT injection (Python code, not bash)
  node -e 'console.log(1)'  - NOT injection (JavaScript code, not bash)
  ruby -e 'puts 1'          - NOT injection (Ruby code, not bash)")
#+end_src

