config/experiments/bash-parser/bash-parser-extensions.el
;;; bash-parser-extensions.el --- Parser extensions -*- lexical-binding: t; -*-

(defun jf/bash-mark-indirect-operations (operations)
  "Mark OPERATIONS as indirect if they should have stricter security policies.

Operations are marked as indirect (:indirect t) if they come from:
- Exec blocks (find -exec, find -execdir)
- Nested commands (bash -c, sh -c, python -c) [future]
- Command substitution [future]

OPERATIONS is a list of operation plists from extraction functions.

Returns updated operations list with :indirect t added where appropriate.

The :indirect flag is a security signal indicating that the operation
will be executed in a nested context, which may require stricter
validation or explicit approval.

Examples:
  ;; Direct operation - not marked
  (jf/bash-mark-indirect-operations
    '((:file \"file.txt\" :operation :read :source :positional-arg)))
  => ((:file \"file.txt\" :operation :read :source :positional-arg))

  ;; Exec block operation - marked as indirect
  (jf/bash-mark-indirect-operations
    '((:file \"{}\" :operation :delete :source :exec-block)))
  => ((:file \"{}\" :operation :delete :source :exec-block :indirect t))

  ;; Mixed operations - only exec-block marked
  (jf/bash-mark-indirect-operations
    '((:file \"a.txt\" :operation :read :source :positional-arg)
      (:file \"{}\" :operation :delete :source :exec-block)))
  => ((:file \"a.txt\" :operation :read :source :positional-arg)
      (:file \"{}\" :operation :delete :source :exec-block :indirect t))"
  (mapcar
   (lambda (op)
     (let ((source (plist-get op :source)))
       (cond
        ;; Exec blocks are always indirect
        ((eq source :exec-block)
         (plist-put (copy-sequence op) :indirect t))

        ;; Already marked as indirect (from nested command parsing)
        ((plist-get op :indirect)
         op)

        ;; Direct operations remain unmarked
        (t op))))
   operations))

(defvar jf/bash-command-injection-patterns
  '((bash . (:flags ("-c") :arg-after-flag t))
    (sh . (:flags ("-c") :arg-after-flag t))
    (zsh . (:flags ("-c") :arg-after-flag t))
    (env . (:flags ("-S" "--split-string") :arg-after-flag t))
    (eval . (:no-flag-required t :first-arg t)))
  "Database of command injection patterns.

Each entry maps a command symbol to detection parameters:
  :flags - List of flags that indicate command injection
  :arg-after-flag - If t, nested command is the argument after the flag
  :no-flag-required - If t, command doesn't need a flag (like eval)
  :first-arg - If t, first positional arg is the nested command

Command injection detection is for SHELL commands that execute nested shell code.
Non-shell interpreters (python -c, node -e, ruby -e, etc.) are NOT injection
because they execute code in their own language, not bash. File operations in
those languages require language-specific parsing.

Rationale for exclusion:
1. Python/Node/Ruby code cannot directly execute bash commands
2. File operations in those languages use language-specific APIs
3. Detecting file ops requires parsing Python/JS/Ruby syntax
4. Current implementation maintains cleaner security model

Examples:
  bash -c 'rm file.txt'     - Flag: -c, nested: 'rm file.txt' (shell injection)
  sh -c 'cat file'          - Flag: -c, nested: 'cat file' (shell injection)
  zsh -c 'cat file'         - Flag: -c, nested: 'cat file' (shell injection)
  env -S 'prog arg'         - Flag: -S, nested: 'prog arg' (shell injection)
  eval 'rm file.txt'        - No flag, nested: 'rm file.txt' (shell injection)
  python -c 'print(1)'      - NOT injection (Python code, not bash)
  node -e 'console.log(1)'  - NOT injection (JavaScript code, not bash)
  ruby -e 'puts 1'          - NOT injection (Ruby code, not bash)")
