config/experiments/bash-parser/bash-parser-extensions.el

(defun jf/bash-detect-command-injection (parsed-command)
  "Detect command injection patterns in PARSED-COMMAND.

Returns plist with command injection metadata if pattern detected, nil otherwise:
  :command-injection - Always t when pattern detected
  :nested-command-string - The nested command string to be executed
  :injection-type - Type of injection (:flag-based or :direct)
  :trigger-flag - The flag that triggers injection (for flag-based)

PARSED-COMMAND is the output from `jf/bash-parse' (simple command only).

Detects patterns like:
  bash -c 'command'    - Flag-based injection
  sh -c 'command'      - Flag-based injection
  python -c 'code'     - Flag-based injection
  env -S 'prog args'   - Flag-based injection
  eval 'command'       - Direct injection (no flag)

Handles flags appearing in different positions:
  bash -x -e -c 'cmd'  - Detects -c despite other flags
  bash -c -x 'cmd'     - Detects -c even with trailing flags

The nested command string is extracted from positional arguments based on
the pattern definition. For flag-based injection, it's typically the first
positional arg after all flags.

Examples:
  (jf/bash-detect-command-injection
    (jf/bash-parse \"bash -c 'rm file.txt'\"))
  => (:command-injection t
      :nested-command-string \"rm file.txt\"
      :injection-type :flag-based
      :trigger-flag \"-c\")

  (jf/bash-detect-command-injection
    (jf/bash-parse \"eval 'rm file.txt'\"))
  => (:command-injection t
      :nested-command-string \"rm file.txt\"
      :injection-type :direct)

  (jf/bash-detect-command-injection
    (jf/bash-parse \"bash script.sh\"))
  => nil  ; No injection pattern detected"
  (let* ((cmd-name (plist-get parsed-command :command-name))
         (flags (plist-get parsed-command :flags))
         (positional-args (plist-get parsed-command :positional-args))
         (pattern nil)
         (result nil))

    ;; Look up command in injection patterns database
    (when (and cmd-name (not (string-match-p "=" cmd-name)))
      (setq pattern (alist-get (intern cmd-name) jf/bash-command-injection-patterns)))

    ;; If pattern found, check if conditions are met
    (when pattern
      (let ((pattern-flags (plist-get pattern :flags))
            (arg-after-flag (plist-get pattern :arg-after-flag))
            (no-flag-required (plist-get pattern :no-flag-required))
            (first-arg (plist-get pattern :first-arg))
            (nested-cmd nil)
            (trigger-flag nil))

        (cond
         ;; No flag required - first positional arg is nested command
         (no-flag-required
          (when (and first-arg positional-args)
            (setq nested-cmd (car positional-args))
            (setq result (list :command-injection t
                              :nested-command-string nested-cmd
                              :injection-type :direct))))

         ;; Flag-based injection - check if trigger flag present
         ((and pattern-flags arg-after-flag)
          ;; Find if any pattern flag is present in command flags
          (dolist (flag pattern-flags)
            (when (and (null trigger-flag)
                      (member flag flags))
              (setq trigger-flag flag)))

          ;; If trigger flag found, extract nested command from positional args
          (when (and trigger-flag positional-args)
            ;; First positional arg (after all flags) is the nested command
            (setq nested-cmd (car positional-args))
            (setq result (list :command-injection t
                              :nested-command-string nested-cmd
                              :injection-type :flag-based
                              :trigger-flag trigger-flag)))))))

    result))

(defun jf/bash--strip-outer-quotes (str)
  "Strip outer single or double quotes from STR.

Preserves inner quotes - only removes matching outermost quote pair.

Handles:
  - Single quotes: 'cmd' -> cmd
  - Double quotes: \"cmd\" -> cmd
  - Preserved inner: 'grep \"pattern\" file' -> grep \"pattern\" file
  - No quotes: Returns str unchanged
  - Escaped quotes: Preserves escaped quotes in result

Examples:
  (jf/bash--strip-outer-quotes \"'rm file.txt'\")
  => \"rm file.txt\"

  (jf/bash--strip-outer-quotes \"\\\"cat file.txt\\\"\")
  => \"cat file.txt\"

  (jf/bash--strip-outer-quotes \"'grep \\\"pattern\\\" file'\")
  => \"grep \\\"pattern\\\" file\"

  (jf/bash--strip-outer-quotes \"no-quotes\")
  => \"no-quotes\"

Limitation: Does not handle escaped outer quotes (\\\\' or \\\\\\\") at the
boundaries. These are rare in practice since bash command strings
typically use different quote types for inner/outer levels."
  (cond
   ;; Single quotes - strip if both start and end match
   ((and (>= (length str) 2)
         (string-prefix-p "'" str)
         (string-suffix-p "'" str))
    (substring str 1 (1- (length str))))

   ;; Double quotes - strip if both start and end match
   ((and (>= (length str) 2)
         (string-prefix-p "\"" str)
         (string-suffix-p "\"" str))
    (substring str 1 (1- (length str))))

   ;; No outer quotes - return unchanged
   (t str)))
