config/experiments/bash-parser/bash-parser-extensions.org
*** Recursive Nested Command Parser

Recursively parse nested command strings with quote stripping and depth tracking.

#+begin_src emacs-lisp
(defun jf/bash-parse-nested-command (nested-command-string &optional nesting-level parent-command)
  "Parse nested command string recursively.

NESTED-COMMAND-STRING is the command string to parse (may have outer quotes).
NESTING-LEVEL is optional recursion depth counter (default 1).
PARENT-COMMAND is optional reference to outer command structure.

Returns parsed command structure with metadata:
  :nested-level - Recursion depth (1 = first nested, 2+ = deeper)
  :parent-command - Reference to outer command (optional)
  :success - t if parsing succeeded
  :error - Error message if parsing failed

Recursion termination:
  - Maximum depth: Controlled by jf/bash-recursive-max-depth (default 10)
  - Returns error plist with :success nil when limit exceeded
  - Detection failure: No more injection patterns found
  - Parse failure: Command string is invalid

Quote handling:
  - Strips outer quotes before parsing: 'cat file' -> cat file
  - Preserves inner quotes: 'grep \"pattern\" file' -> grep \"pattern\" file
  - Handles both single and double quotes

Examples:
  ;; Single nesting
  (jf/bash-parse-nested-command \"'rm file.txt'\")
  => (:command-name \"rm\" :positional-args (\"file.txt\")
      :nested-level 1 :success t ...)

  ;; Multiple nesting
  (jf/bash-parse-nested-command \"'bash -c \\\"rm file\\\"'\")
  => (:command-name \"bash\" :flags (\"-c\")
      :positional-args (\"rm file\")
      :nested-command (:command-name \"rm\" :positional-args (\"file\")
                       :nested-level 2 :success t ...)
      :nested-level 1 :success t ...)

  ;; Maximum depth exceeded
  (jf/bash-parse-nested-command (deeply-nested-command) 11)
  => (:success nil :error \"Maximum nesting depth exceeded\")

Integration:
  This function is called by file operation extraction to recursively
  extract operations from nested commands. Operations from nested commands
  are marked with :indirect t to indicate indirect execution.

Nesting levels:
  - 0: Top-level command (not nested, parsed via jf/bash-parse)
  - 1: First level of nesting (bash -c 'cmd')
  - 2+: Deeper nesting levels (bash -c \"bash -c 'cmd'\")"
  (let ((level (or nesting-level 1)))
    ;; Check recursion depth limit - use >= for consistency across modules
    (if (>= level jf/bash-recursive-max-depth)
        (list :success nil
              :error (format "Maximum nesting depth exceeded (limit: %d)" jf/bash-recursive-max-depth)
              :nested-level level)

      ;; Strip outer quotes and parse
      (let* ((stripped (jf/bash--strip-outer-quotes nested-command-string))
             (parsed (jf/bash-parse stripped)))

        (when (plist-get parsed :success)
          ;; Add nesting level metadata
          (setq parsed (plist-put parsed :nested-level level))

          ;; Add parent command reference if provided
          (when parent-command
            (setq parsed (plist-put parsed :parent-command parent-command)))

          ;; Check if this parsed command itself contains injection
          (when-let ((injection-info (jf/bash-detect-command-injection parsed)))
            (let ((nested-cmd-string (plist-get injection-info :nested-command-string)))
              ;; Recursively parse the nested injection
              (when nested-cmd-string
                (let ((nested-parsed (jf/bash-parse-nested-command
                                     nested-cmd-string
                                     (1+ level)
                                     parsed)))
                  ;; Add nested command to parsed structure
                  (setq parsed (plist-put parsed :nested-command nested-parsed)))))))

        parsed))))
#+end_src

*** Usage Example

Integration with file operations extraction:

#+begin_src emacs-lisp :tangle no
;; Extract file operations from nested command
(let* ((parsed (jf/bash-parse "bash -c 'rm /workspace/temp.txt'"))
       (injection-info (jf/bash-detect-command-injection parsed)))

  (when injection-info
    (let* ((nested-cmd-string (plist-get injection-info :nested-command-string))
           (nested-parsed (jf/bash-parse-nested-command nested-cmd-string))
           (nested-ops (jf/bash-extract-file-operations nested-parsed)))

      ;; Mark operations as indirect
      (mapcar (lambda (op)
                (plist-put op :indirect t))
              nested-ops))))
#+end_src

This enables security validation of nested commands by recursively parsing and extracting file operations from command injection patterns.

* Provide

#+begin_src emacs-lisp
(provide 'bash-parser-extensions)
;;; bash-parser-extensions.el ends here
#+end_src
